/*
   Copyright 2016 Aldo J. Nunez

   Licensed under the Apache License, Version 2.0.
   See the LICENSE text file for details.
*/

#include "Common.h"
#include "World.h"
#include "Graphics.h"
#include "Input.h"
#include "TileAttr.h"
#include "Player.h"
#include "ItemObj.h"
#include "PlayerItemsAnim.h"
#include "SpriteAnimator.h"
#include "ObjType.h"
#include "Monsters.h"
#include "Profile.h"
#include "Credits.h"
#include "TextBox.h"
#include "UWBossAnim.h"
#include "GameMenu.h"
#include "RegisterMenu.h"
#include "EliminateMenu.h"
#include "SaveFolder.h"
#include "Sound.h"
#include "SoundId.h"


enum
{
    LevelGroups     = 3,
};

enum
{
    Cave_Items      = 0x79,
    Cave_Shortcut   = 0x7A,
};

enum Secret
{
    Secret_None,
    Secret_FoesDoor,
    Secret_Ringleader,
    Secret_LastBoss,
    Secret_BlockDoor,
    Secret_BlockStairs,
    Secret_MoneyOrLife,
    Secret_FoesItem
};

struct SparseRoomAttr
{
    uint8_t     roomId;
    OWRoomAttrs attrs;
};

struct SparseMaze
{
    uint8_t     roomId;
    uint8_t     exitDir;
    uint8_t     path[4];
};

struct SparseRoomItem
{
    uint8_t     roomId;
    uint8_t     x;
    uint8_t     y;
    uint8_t     itemId;
};


enum
{
    Sparse_ArmosStairs,
    Sparse_ArmosItem,
    Sparse_Dock,
    Sparse_Item,
    Sparse_Shortcut,
    Sparse_Maze,
    Sparse_SecretScroll,
    Sparse_Ladder,
    Sparse_Recorder,
    Sparse_Fairy,
    Sparse_RoomReplacement,
};

enum
{
    Extra_PondColors,
    Extra_SpawnSpots,
    Extra_ObjAttrs,
    Extra_CavePalettes,
    Extra_Caves,
    Extra_LevelPersonStringIds,
    Extra_HitPoints,
    Extra_PlayerDamage,
};

struct ColorSeq
{
    int     Length;
    uint8_t Colors[1];
};

struct SpotSeq
{
    int     Length;
    RSpot   Spots[1];
};

struct PaletteSet
{
    int     Length;
    int     Start;
    uint8_t Palettes[1][PaletteLength];
};

struct CaveSpecList
{
    int         Count;
    CaveSpec    Specs[1];
};

struct LevelPersonStrings
{
    uint8_t StringIds[LevelGroups][PersonTypes];
};

const int OWMarginRight  = 0xE0;
const int OWMarginLeft   = 0x10;
const int OWMarginTop    = 0x4D;
const int OWMarginBottom = 0xCD;

const int UWMarginRight  = 0xD0;
const int UWMarginLeft   = 0x20;
const int UWMarginTop    = 0x5D;
const int UWMarginBottom = 0xBD;

const int UWBorderRight  = 0xE0;
const int UWBorderLeft   = 0x20;
const int UWBorderTop    = 0x60;
const int UWBorderBottom = 0xD0;

const int UWBlockRow        = 5;

const int DoorWidth         = 32;
const int DoorHeight        = 32;
const int DoorOverlayBaseY  = 128;
const int DoorUnderlayBaseY = 0;

const int DoorHoleCoordH = 0x90;
const int DoorHoleCoordV = 0x78;

const int UWBombRadius = 32;

static const uint8_t levelGroups[] = 
{
    0, 0, 1, 1, 0, 1, 0, 1, 2
};

const Point doorMiddles[] = 
{
    { 0xE0, 0x98 },
    { 0x20, 0x98 },
    { 0x80, 0xD0 },
    { 0x80, 0x60 }
};

const int doorSrcYs[] = 
{
    64,
    96,
    0,
    32
};

const Point doorPos[] = 
{
    { 224,  136 },
    { 0,    136 },
    { 112,  208 },
    { 112,  64 }
};

struct DoorStateFaces
{
    uint8_t Closed;
    uint8_t Open;
};

const DoorStateFaces doorFaces[] = 
{
    { 0, 0 },
    { 3, 3 },
    { 3, 3 },
    { 3, 3 },
    { 3, 4 },
    { 1, 0 },
    { 1, 0 },
    { 2, 0 },
};

const bool doorFaceOpen[] = 
{
    true,
    false,
    false,
    false,
    true
};

struct EquipValue
{
    uint8_t Value;
    uint8_t Slot;
};

// The item ID to item slot map is at $6B14, and copied to RAM at $72A4.
// The item ID to item value map is at $6B38, and copied to RAM at $72C8.
// They're combined here.
static const EquipValue sItemToEquipment[] = 
{
    { 4, ItemSlot_Bombs },
    { 1, ItemSlot_Sword },
    { 2, ItemSlot_Sword },
    { 3, ItemSlot_Sword },
    { 1, ItemSlot_Food },
    { 1, ItemSlot_Recorder },
    { 1, ItemSlot_Candle },
    { 2, ItemSlot_Candle },
    { 1, ItemSlot_Arrow },
    { 2, ItemSlot_Arrow },
    { 1, ItemSlot_Bow },
    { 1, ItemSlot_MagicKey },
    { 1, ItemSlot_Raft },
    { 1, ItemSlot_Ladder },
    { 1, ItemSlot_PowerTriforce },
    { 5, ItemSlot_RupeesToAdd },
    { 1, ItemSlot_Rod },
    { 1, ItemSlot_Book },
    { 1, ItemSlot_Ring },
    { 2, ItemSlot_Ring },
    { 1, ItemSlot_Bracelet },
    { 1, ItemSlot_Letter },
    { 1, ItemSlot_Compass9 },
    { 1, ItemSlot_Map9 },
    { 1, ItemSlot_RupeesToAdd },
    { 1, ItemSlot_Keys },
    { 1, ItemSlot_HeartContainers },
    { 1, ItemSlot_TriforcePieces },
    { 1, ItemSlot_MagicShield },
    { 1, ItemSlot_Boomerang },
    { 2, ItemSlot_Boomerang },
    { 1, ItemSlot_Potion },
    { 2, ItemSlot_Potion },
    { 1, ItemSlot_Clock },
    { 1, ItemSlot_Bombs },
    { 3, ItemSlot_Bombs },
};

static const uint8_t teleportYs[] = { 0x8D, 0xAD, 0x8D, 0x8D, 0xAD, 0x8D, 0xAD, 0x5D };
static const uint8_t teleportRoomIds[] = { 0x36, 0x3B, 0x73, 0x44, 0x0A, 0x21, 0x41, 0x6C };

const int StartX = 0x78;
const int FirstCaveIndex = 0x10;
const int TriforcePieceX = 0x78;


World::TileActionFunc World::sActionFuncs[] = 
{
    &World::NoneTileAction,
    &World::PushTileAction,
    &World::BombTileAction,
    &World::BurnTileAction,
    &World::HeadstoneTileAction,
    &World::LadderTileAction,
    &World::RaftTileAction,
    &World::CaveTileAction,
    &World::StairsTileAction,
    &World::GhostTileAction,
    &World::ArmosTileAction,
    &World::BlockTileAction,
};

World* World::sWorld;

Player* player;
bool    giveFakePlayerPos;
int     playerPosTimer;
Point   fakePlayerPos;

Object* objects[MaxObjects];
Object* objectsToDelete[MaxObjects];
int     objectsToDeleteCount;
int     objectTimers[MaxObjects];
int     curObjSlot;
int     longTimer;
int     stunTimers[MaxObjects];
uint8_t placeholderTypes[MaxObjects];

Direction       doorwayDir;         // 53
int             triggeredDoorCmd;   // 54
Direction       triggeredDoorDir;   // 55
int             fromUnderground;    // 5A
int             activeShots;        // 34C
bool            triggerShutters;    // 4CE
bool            summonedWhirlwind;  // 508
bool            powerTriforceFanfare;   // 509
int             recorderUsed;       // 51B
bool            candleUsed;         // 513
Direction       shuttersPassedDirs; // 519
bool            brightenRoom;       // 51E
int             profileSlot;
Profile         profile;
UWRoomFlags*    curUWBlockFlags;


void GetWorldCoord( int roomId, int& row, int& col )
{
    row = (roomId & 0xF0) >> 4;
    col = roomId & 0x0F;
}

int MakeRoomId( int row, int col )
{
    return (row << 4) | col;
}

int GetNextRoomId( int curRoomId, Direction dir )
{
    int row;
    int col;

    GetWorldCoord( curRoomId, row, col );

    switch ( dir )
    {
    case Dir_Left:
        if ( col == 0 )
            return curRoomId;
        col--;
        break;

    case Dir_Right:
        if ( col == World::WorldWidth - 1 )
            return curRoomId;
        col++;
        break;

    case Dir_Up:
        if ( row == 0 )
            return curRoomId;
        row--;
        break;

    case Dir_Down:
        if ( row == World::WorldHeight - 1 )
            return curRoomId;
        row++;
        break;
    }

